espressif/esp-idf/examples/ethernet/basic/sdkconfig.ci.lan8720_esp32
# RMII GPIO Configuration to align with LAN8720 test board
CONFIG_IDF_TARGET="esp32"

CONFIG_EXAMPLE_ETH_PHY_INTERFACE_RMII=y
CONFIG_EXAMPLE_ETH_RMII_CLK_OUTPUT=y
CONFIG_EXAMPLE_ETH_RMII_CLK_GPIO=17
CONFIG_EXAMPLE_ETH_PHY_RST_GPIO=5
CONFIG_EXAMPLE_ETH_PHY_ADDR=0
